Revit 2027 API
FamilyInstance.GetSubComponentIds Method
Gets the sub component ElementIds of the current family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetSubComponentIds()
Public Function GetSubComponentIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetSubComponentIds()
member GetSubComponentIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The subcomponent ElementIDs
Example
public void GetSubAndSuperComponents(FamilyInstance familyInstance)
{
    ICollection<ElementId> subElemSet = familyInstance.GetSubComponentIds();
    if (subElemSet != null)
    {
        string subElems = "";
        foreach (Autodesk.Revit.DB.ElementId ee in subElemSet)
        {
            FamilyInstance f = familyInstance.Document.GetElement(ee) as FamilyInstance;
            subElems = subElems + f.Name + "\n";
        }
        TaskDialog.Show("Revit","Subcomponent count = " + subElemSet.Count + "\n" + subElems);
    }
    FamilyInstance super = familyInstance.SuperComponent as FamilyInstance;
    if (super != null)
    {
        TaskDialog.Show("Revit","SUPER component: " + super.Name);
    }
}
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace